; ModuleID = '/home/clexma/Desktop/Disk_D/Tools/SMACK/SmackBasedPrj/build/b-47ud_621.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.L0 = type { %struct.L0**, %struct.L0*, %struct.L1* }
%struct.L1 = type { %struct.L2*, %struct.L1*, %struct.L1** }
%struct.L2 = type { %struct.L2**, %struct.L2*, %struct.L3* }
%struct.L3 = type { %struct.L4*, %struct.L3*, %struct.L3** }
%struct.L4 = type { %struct.L4**, %struct.L4*, %struct.L5* }
%struct.L5 = type opaque

@.str = private unnamed_addr constant [2 x i8] c"0\00", align 1
@.str.1 = private unnamed_addr constant [12 x i8] c"test-0236.c\00", align 1
@__PRETTY_FUNCTION__.reach_error = private unnamed_addr constant [19 x i8] c"void reach_error()\00", align 1
@main.list = internal global %struct.L0* null, align 8, !dbg !0

; Function Attrs: noinline nounwind uwtable
define internal void @reach_error() #0 !dbg !54 {
  call void @__assert_fail(i8* getelementptr inbounds ([2 x i8], [2 x i8]* @.str, i64 0, i64 0), i8* getelementptr inbounds ([12 x i8], [12 x i8]* @.str.1, i64 0, i64 0), i32 3, i8* getelementptr inbounds ([19 x i8], [19 x i8]* @__PRETTY_FUNCTION__.reach_error, i64 0, i64 0)) #5, !dbg !57, !verifier.code !60
  unreachable, !dbg !57, !verifier.code !60
}

; Function Attrs: noreturn nounwind
declare dso_local void @__assert_fail(i8*, i8*, i32, i8*) #1

; Function Attrs: noinline nounwind uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "list", scope: !2, file: !3, line: 778, type: !13, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 776, type: !4, scopeLine: 777, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !8)
!3 = !DIFile(filename: "../testcases/svcomp/memsafety/test-0236.i", directory: "/home/clexma/Desktop/Disk_D/Tools/SMACK/SmackBasedPrj/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, retainedTypes: !9, globals: !12, splitDebugInlining: false, nameTableKind: None)
!8 = !{}
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !{!0}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L0", file: !3, line: 665, size: 192, elements: !15)
!15 = !{!16, !18, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !14, file: !3, line: 666, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !3, line: 667, baseType: !13, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !14, file: !3, line: 668, baseType: !20, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L1", file: !3, line: 660, size: 192, elements: !22)
!22 = !{!23, !47, !48}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !21, file: !3, line: 661, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L2", file: !3, line: 655, size: 192, elements: !26)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !25, file: !3, line: 656, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !25, file: !3, line: 657, baseType: !24, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !25, file: !3, line: 658, baseType: !31, size: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L3", file: !3, line: 650, size: 192, elements: !33)
!33 = !{!34, !44, !45}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !32, file: !3, line: 651, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L4", file: !3, line: 645, size: 192, elements: !37)
!37 = !{!38, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !36, file: !3, line: 646, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !3, line: 647, baseType: !35, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !36, file: !3, line: 648, baseType: !42, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "L5", file: !3, line: 648, flags: DIFlagFwdDecl)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !32, file: !3, line: 652, baseType: !31, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !32, file: !3, line: 653, baseType: !46, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !3, line: 662, baseType: !20, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !21, file: !3, line: 663, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!50 = !{!"clang version 10.0.0-4ubuntu1 "}
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = distinct !DISubprogram(name: "reach_error", scope: !3, file: !3, line: 12, type: !55, scopeLine: 12, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !8)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DILocation(line: 12, column: 83, scope: !58)
!58 = distinct !DILexicalBlock(scope: !59, file: !3, line: 12, column: 73)
!59 = distinct !DILexicalBlock(scope: !54, file: !3, line: 12, column: 67)
!60 = !{i1 false}
!61 = !DILocation(line: 779, column: 5, scope: !2)
!62 = !DILocation(line: 780, column: 9, scope: !2)
!63 = !DILocation(line: 781, column: 12, scope: !2)
!64 = !{i1 true}
!65 = distinct !{!65, !61, !66}
!66 = !DILocation(line: 781, column: 35, scope: !2)
!67 = !DILocation(line: 782, column: 16, scope: !2)
!68 = !DILocation(line: 782, column: 5, scope: !2)
!69 = !DILocation(line: 783, column: 1, scope: !2)
!70 = distinct !DISubprogram(name: "l0_insert", scope: !3, file: !3, line: 716, type: !71, scopeLine: 717, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !8)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !17}
!73 = !DILocalVariable(name: "list", arg: 1, scope: !70, file: !3, line: 716, type: !17)
!74 = !DILocation(line: 0, scope: !70)
!75 = !DILocation(line: 718, column: 23, scope: !70)
!76 = !DILocalVariable(name: "item", scope: !70, file: !3, line: 718, type: !13)
!77 = !DILocation(line: 719, column: 5, scope: !70)
!78 = !DILocation(line: 720, column: 26, scope: !70)
!79 = !DILocation(line: 720, column: 9, scope: !70)
!80 = !DILocation(line: 721, column: 12, scope: !70)
!81 = distinct !{!81, !77, !82}
!82 = !DILocation(line: 721, column: 35, scope: !70)
!83 = !DILocation(line: 722, column: 11, scope: !70)
!84 = !DILocation(line: 722, column: 17, scope: !70)
!85 = !DILocation(line: 723, column: 18, scope: !70)
!86 = !DILocation(line: 723, column: 11, scope: !70)
!87 = !DILocation(line: 723, column: 16, scope: !70)
!88 = !DILocation(line: 724, column: 11, scope: !70)
!89 = !DILocation(line: 725, column: 1, scope: !70)
!90 = distinct !DISubprogram(name: "l0_destroy", scope: !3, file: !3, line: 766, type: !91, scopeLine: 767, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !8)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !13}
!93 = !DILocalVariable(name: "list", arg: 1, scope: !90, file: !3, line: 766, type: !13)
!94 = !DILocation(line: 0, scope: !90)
!95 = !DILocation(line: 768, column: 5, scope: !90)
!96 = !DILocation(line: 769, column: 26, scope: !97)
!97 = distinct !DILexicalBlock(scope: !90, file: !3, line: 768, column: 8)
!98 = !DILocation(line: 769, column: 9, scope: !97)
!99 = !DILocation(line: 770, column: 33, scope: !97)
!100 = !DILocalVariable(name: "next", scope: !97, file: !3, line: 770, type: !13)
!101 = !DILocation(line: 0, scope: !97)
!102 = !DILocation(line: 771, column: 14, scope: !97)
!103 = !DILocation(line: 771, column: 9, scope: !97)
!104 = !DILocation(line: 773, column: 5, scope: !97)
!105 = distinct !{!105, !95, !106}
!106 = !DILocation(line: 774, column: 16, scope: !90)
!107 = !DILocation(line: 775, column: 1, scope: !90)
!108 = distinct !DISubprogram(name: "l1_destroy", scope: !3, file: !3, line: 756, type: !109, scopeLine: 757, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !8)
!109 = !DISubroutineType(types: !110)
!110 = !{null, !20}
!111 = !DILocalVariable(name: "list", arg: 1, scope: !108, file: !3, line: 756, type: !20)
!112 = !DILocation(line: 0, scope: !108)
!113 = !DILocation(line: 758, column: 5, scope: !108)
!114 = !DILocation(line: 759, column: 26, scope: !115)
