; ModuleID = '/home/clexma/Desktop/Disk_D/Tools/SMACK/SmackBasedPrj/build/b-1qbnz9tj.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.L0 = type { %struct.L0*, %struct.L1* }
%struct.L1 = type { %struct.L2*, %struct.L1*, %struct.L1** }
%struct.L2 = type { %struct.L1**, %struct.L2*, %struct.L3* }
%struct.L3 = type { %struct.L4*, %struct.L3*, %struct.L3** }
%struct.L4 = type { %struct.L3**, %struct.L4*, %struct.L5* }
%struct.L5 = type opaque

@.str = private unnamed_addr constant [2 x i8] c"0\00", align 1
@.str.1 = private unnamed_addr constant [12 x i8] c"test-0237.c\00", align 1
@__PRETTY_FUNCTION__.reach_error = private unnamed_addr constant [19 x i8] c"void reach_error()\00", align 1
@main.list = internal global %struct.L0* null, align 8, !dbg !0

; Function Attrs: noinline nounwind uwtable
define internal void @reach_error() #0 !dbg !50 {
  call void @__assert_fail(i8* getelementptr inbounds ([2 x i8], [2 x i8]* @.str, i64 0, i64 0), i8* getelementptr inbounds ([12 x i8], [12 x i8]* @.str.1, i64 0, i64 0), i32 3, i8* getelementptr inbounds ([19 x i8], [19 x i8]* @__PRETTY_FUNCTION__.reach_error, i64 0, i64 0)) #5, !dbg !53, !verifier.code !56
  unreachable, !dbg !53, !verifier.code !56
}

; Function Attrs: noreturn nounwind
declare dso_local void @__assert_fail(i8*, i8*, i32, i8*) #1

; Function Attrs: noinline nounwind uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "list", scope: !2, file: !3, line: 776, type: !13, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 774, type: !4, scopeLine: 775, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !8)
!3 = !DIFile(filename: "../testcases/svcomp/memsafety/test-0237.i", directory: "/home/clexma/Desktop/Disk_D/Tools/SMACK/SmackBasedPrj/build")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, retainedTypes: !9, globals: !12, splitDebugInlining: false, nameTableKind: None)
!8 = !{}
!9 = !{!10}
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !{!0}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L0", file: !3, line: 665, size: 128, elements: !15)
!15 = !{!16, !17}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !3, line: 666, baseType: !13, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !14, file: !3, line: 667, baseType: !18, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L1", file: !3, line: 660, size: 192, elements: !20)
!20 = !{!21, !44, !45}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !19, file: !3, line: 661, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L2", file: !3, line: 655, size: 192, elements: !24)
!24 = !{!25, !27, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !23, file: !3, line: 656, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !23, file: !3, line: 657, baseType: !22, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !23, file: !3, line: 658, baseType: !29, size: 64, offset: 128)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L3", file: !3, line: 650, size: 192, elements: !31)
!31 = !{!32, !42, !43}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !30, file: !3, line: 651, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L4", file: !3, line: 645, size: 192, elements: !35)
!35 = !{!36, !38, !39}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !34, file: !3, line: 646, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !3, line: 647, baseType: !33, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !34, file: !3, line: 648, baseType: !40, size: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "L5", file: !3, line: 648, flags: DIFlagFwdDecl)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !3, line: 652, baseType: !29, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !30, file: !3, line: 653, baseType: !37, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !3, line: 662, baseType: !18, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !19, file: !3, line: 663, baseType: !26, size: 64, offset: 128)
!46 = !{!"clang version 10.0.0-4ubuntu1 "}
!47 = !{i32 7, !"Dwarf Version", i32 4}
!48 = !{i32 2, !"Debug Info Version", i32 3}
!49 = !{i32 1, !"wchar_size", i32 4}
!50 = distinct !DISubprogram(name: "reach_error", scope: !3, file: !3, line: 12, type: !51, scopeLine: 12, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !8)
!51 = !DISubroutineType(types: !52)
!52 = !{null}
!53 = !DILocation(line: 12, column: 83, scope: !54)
!54 = distinct !DILexicalBlock(scope: !55, file: !3, line: 12, column: 73)
!55 = distinct !DILexicalBlock(scope: !50, file: !3, line: 12, column: 67)
!56 = !{i1 false}
!57 = !DILocation(line: 777, column: 5, scope: !2)
!58 = !DILocation(line: 778, column: 9, scope: !2)
!59 = !DILocation(line: 779, column: 12, scope: !2)
!60 = !{i1 true}
!61 = distinct !{!61, !57, !62}
!62 = !DILocation(line: 779, column: 35, scope: !2)
!63 = !DILocation(line: 780, column: 16, scope: !2)
!64 = !DILocation(line: 780, column: 5, scope: !2)
!65 = !DILocation(line: 781, column: 1, scope: !2)
!66 = distinct !DISubprogram(name: "l0_insert", scope: !3, file: !3, line: 715, type: !67, scopeLine: 716, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !8)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!70 = !DILocalVariable(name: "list", arg: 1, scope: !66, file: !3, line: 715, type: !69)
!71 = !DILocation(line: 0, scope: !66)
!72 = !DILocation(line: 717, column: 23, scope: !66)
!73 = !DILocalVariable(name: "item", scope: !66, file: !3, line: 717, type: !13)
!74 = !DILocation(line: 718, column: 5, scope: !66)
!75 = !DILocation(line: 719, column: 26, scope: !66)
!76 = !DILocation(line: 719, column: 9, scope: !66)
!77 = !DILocation(line: 720, column: 12, scope: !66)
!78 = distinct !{!78, !74, !79}
!79 = !DILocation(line: 720, column: 35, scope: !66)
!80 = !DILocation(line: 721, column: 18, scope: !66)
!81 = !DILocation(line: 721, column: 11, scope: !66)
!82 = !DILocation(line: 721, column: 16, scope: !66)
!83 = !DILocation(line: 722, column: 11, scope: !66)
!84 = !DILocation(line: 723, column: 1, scope: !66)
!85 = distinct !DISubprogram(name: "l0_destroy", scope: !3, file: !3, line: 764, type: !86, scopeLine: 765, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !8)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !13}
!88 = !DILocalVariable(name: "list", arg: 1, scope: !85, file: !3, line: 764, type: !13)
!89 = !DILocation(line: 0, scope: !85)
!90 = !DILocation(line: 766, column: 5, scope: !85)
!91 = !DILocation(line: 767, column: 26, scope: !92)
!92 = distinct !DILexicalBlock(scope: !85, file: !3, line: 766, column: 8)
!93 = !DILocation(line: 767, column: 9, scope: !92)
!94 = !DILocation(line: 768, column: 33, scope: !92)
!95 = !DILocalVariable(name: "next", scope: !92, file: !3, line: 768, type: !13)
!96 = !DILocation(line: 0, scope: !92)
!97 = !DILocation(line: 769, column: 14, scope: !92)
!98 = !DILocation(line: 769, column: 9, scope: !92)
!99 = !DILocation(line: 771, column: 5, scope: !92)
!100 = distinct !{!100, !90, !101}
!101 = !DILocation(line: 772, column: 16, scope: !85)
!102 = !DILocation(line: 773, column: 1, scope: !85)
!103 = distinct !DISubprogram(name: "l1_destroy", scope: !3, file: !3, line: 754, type: !104, scopeLine: 755, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !8)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !18}
!106 = !DILocalVariable(name: "list", arg: 1, scope: !103, file: !3, line: 754, type: !18)
!107 = !DILocation(line: 0, scope: !103)
!108 = !DILocation(line: 756, column: 5, scope: !103)
!109 = !DILocation(line: 757, column: 26, scope: !110)
!110 = distinct !DILexicalBlock(scope: !103, file: !3, line: 756, column: 8)
