; ModuleID = '/home/clexma/Desktop/Disk_D/Tools/SMACK/SmackBasedPrj/testcases/benchmark/b-i8eykbed.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.L0 = type { %struct.L0*, %struct.L1* }
%struct.L1 = type { %struct.L2*, %struct.L1*, %struct.L1** }
%struct.L2 = type { %struct.L1**, %struct.L2*, %struct.L3* }
%struct.L3 = type { %struct.L4*, %struct.L3*, %struct.L3** }
%struct.L4 = type { %struct.L3**, %struct.L4*, %struct.L5* }
%struct.L5 = type opaque

@.str = private unnamed_addr constant [2 x i8] c"0\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"../svcomp/memsafety//test-0237.c\00", align 1
@__PRETTY_FUNCTION__.reach_error = private unnamed_addr constant [19 x i8] c"void reach_error()\00", align 1
@main.list = internal global %struct.L0* null, align 8, !dbg !0

; Function Attrs: noinline nounwind uwtable
define internal void @reach_error() #0 !dbg !51 {
  call void @__assert_fail(i8* getelementptr inbounds ([2 x i8], [2 x i8]* @.str, i64 0, i64 0), i8* getelementptr inbounds ([33 x i8], [33 x i8]* @.str.1, i64 0, i64 0), i32 3, i8* getelementptr inbounds ([19 x i8], [19 x i8]* @__PRETTY_FUNCTION__.reach_error, i64 0, i64 0)) #6, !dbg !54, !verifier.code !57
  unreachable, !dbg !54, !verifier.code !57
}

; Function Attrs: noreturn nounwind
declare dso_local void @__assert_fail(i8*, i8*, i32, i8*) #1


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "list", scope: !2, file: !3, line: 177, type: !14, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 175, type: !4, scopeLine: 176, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!3 = !DIFile(filename: "../svcomp/memsafety//test-0237.c", directory: "/home/clexma/Desktop/Disk_D/Tools/SMACK/SmackBasedPrj/testcases/benchmark")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !8, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, retainedTypes: !10, globals: !13, splitDebugInlining: false, nameTableKind: None)
!8 = !DIFile(filename: "../svcomp/memsafety/test-0237.c", directory: "/home/clexma/Desktop/Disk_D/Tools/SMACK/SmackBasedPrj/testcases/benchmark")
!9 = !{}
!10 = !{!11}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !{!0}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L0", file: !3, line: 39, size: 128, elements: !16)
!16 = !{!17, !18}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !15, file: !3, line: 40, baseType: !14, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !15, file: !3, line: 41, baseType: !19, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L1", file: !3, line: 33, size: 192, elements: !21)
!21 = !{!22, !45, !46}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !20, file: !3, line: 34, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L2", file: !3, line: 27, size: 192, elements: !25)
!25 = !{!26, !28, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !24, file: !3, line: 28, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !24, file: !3, line: 29, baseType: !23, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !24, file: !3, line: 30, baseType: !30, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L3", file: !3, line: 21, size: 192, elements: !32)
!32 = !{!33, !43, !44}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !31, file: !3, line: 22, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "L4", file: !3, line: 15, size: 192, elements: !36)
!36 = !{!37, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !35, file: !3, line: 16, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !35, file: !3, line: 17, baseType: !34, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "down", scope: !35, file: !3, line: 18, baseType: !41, size: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "L5", file: !3, line: 18, flags: DIFlagFwdDecl)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !31, file: !3, line: 23, baseType: !30, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !31, file: !3, line: 24, baseType: !38, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !20, file: !3, line: 35, baseType: !19, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !20, file: !3, line: 36, baseType: !27, size: 64, offset: 128)
!47 = !{!"clang version 10.0.0-4ubuntu1 "}
!48 = !{i32 7, !"Dwarf Version", i32 4}
!49 = !{i32 2, !"Debug Info Version", i32 3}
!50 = !{i32 1, !"wchar_size", i32 4}
!51 = distinct !DISubprogram(name: "reach_error", scope: !3, file: !3, line: 3, type: !52, scopeLine: 3, spFlags: DISPFlagDefinition, unit: !7, retainedNodes: !9)
!52 = !DISubroutineType(types: !53)
!53 = !{null}
!54 = !DILocation(line: 3, column: 22, scope: !55)
!55 = distinct !DILexicalBlock(scope: !56, file: !3, line: 3, column: 22)
!56 = distinct !DILexicalBlock(scope: !51, file: !3, line: 3, column: 22)
!57 = !{i1 false}
!58 = !DILocation(line: 179, column: 5, scope: !2)
!59 = !DILocation(line: 180, column: 9, scope: !2)
!60 = !DILocation(line: 181, column: 12, scope: !2)
!61 = !{i1 true}
!62 = distinct !{!62, !58, !63}
!63 = !DILocation(line: 181, column: 35, scope: !2)
!64 = !DILocation(line: 183, column: 16, scope: !2)
!65 = !DILocation(line: 183, column: 5, scope: !2)
!66 = !DILocation(line: 184, column: 1, scope: !2)
!67 = distinct !DISubprogram(name: "l0_insert", scope: !3, file: !3, line: 103, type: !68, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !9)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!71 = !DILocalVariable(name: "list", arg: 1, scope: !67, file: !3, line: 103, type: !70)
!72 = !DILocation(line: 0, scope: !67)
!73 = !DILocation(line: 105, column: 23, scope: !67)
!74 = !DILocalVariable(name: "item", scope: !67, file: !3, line: 105, type: !14)
!75 = !DILocation(line: 107, column: 5, scope: !67)
!76 = !DILocation(line: 108, column: 26, scope: !67)
!77 = !DILocation(line: 108, column: 9, scope: !67)
!78 = !DILocation(line: 109, column: 12, scope: !67)
!79 = distinct !{!79, !75, !80}
!80 = !DILocation(line: 109, column: 35, scope: !67)
!81 = !DILocation(line: 111, column: 18, scope: !67)
!82 = !DILocation(line: 111, column: 11, scope: !67)
!83 = !DILocation(line: 111, column: 16, scope: !67)
!84 = !DILocation(line: 112, column: 11, scope: !67)
!85 = !DILocation(line: 113, column: 1, scope: !67)
!86 = distinct !DISubprogram(name: "l0_destroy", scope: !3, file: !3, line: 163, type: !87, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !9)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !14}
!89 = !DILocalVariable(name: "list", arg: 1, scope: !86, file: !3, line: 163, type: !14)
!90 = !DILocation(line: 0, scope: !86)
!91 = !DILocation(line: 165, column: 5, scope: !86)
!92 = !DILocation(line: 166, column: 26, scope: !93)
!93 = distinct !DILexicalBlock(scope: !86, file: !3, line: 165, column: 8)
!94 = !DILocation(line: 166, column: 9, scope: !93)
!95 = !DILocation(line: 168, column: 33, scope: !93)
!96 = !DILocalVariable(name: "next", scope: !93, file: !3, line: 168, type: !14)
!97 = !DILocation(line: 0, scope: !93)
!98 = !DILocation(line: 169, column: 14, scope: !93)
!99 = !DILocation(line: 169, column: 9, scope: !93)
!100 = !DILocation(line: 171, column: 5, scope: !93)
!101 = distinct !{!101, !91, !102}
!102 = !DILocation(line: 172, column: 16, scope: !86)
!103 = !DILocation(line: 173, column: 1, scope: !86)
!104 = distinct !DISubprogram(name: "l1_destroy", scope: !3, file: !3, line: 151, type: !105, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !7, retainedNodes: !9)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !19}
!107 = !DILocalVariable(name: "list", arg: 1, scope: !104, file: !3, line: 151, type: !19)
!108 = !DILocation(line: 0, scope: !104)
!109 = !DILocation(line: 153, column: 5, scope: !104)
!110 = !DILocation(line: 154, column: 26, scope: !111)
!111 = distinct !DILexicalBlock(scope: !104, file: !3, line: 153, column: 8)
